from colorama import Fore, Style, init
import os

# Установка заголовка окна консоли
os.system("title GrassBot")

# Инициализация Colorama
init(autoreset=True)

# Вывод смещённого и окрашенного текста (теперь он оранжевого цвета)
print(Fore.GREEN + """
      ________  ________  ________  ________   ________                 ________  ________  _________   
     |\\   ____\\|\\   __  \\|\\   __  \\|\\   ____\\ |\\   ____\\               |\\   __  \\|\\   __  \\|\\___   ___\\ 
     \\ \\  \\___|\\ \\  \\|\\  \\ \\  \\|\\  \\ \\  \\___|_\\ \\  \\___|_  ____________\\ \\  \\|\\ /\\ \\  \\|\\  \\|___ \\  \\_| 
      \\ \\  \\  __\\ \\   _  _\\ \\   __  \\ \\_____  \\\\ \\_____  \\|\\____________\\ \\   __  \\ \\  \\\\\\  \\   \\ \\  \\  
       \\ \\  \\|\\  \\ \\  \\\\  \\\\ \\  \\ \\  \\|____|\\  \\\\|____|\\  \\|____________|\\ \\  \\|\\  \\ \\  \\\\\\  \\   \\ \\  \\ 
        \\ \\_______\\ \\__\\\\ _\\\\ \\__\\ \\__\\____\\_\\  \\ ____\\_\\  \\              \\ \\_______\\ \\_______\\   \\ \\__\\
         \\|_______|\\|__|\\|__|\\|__|\\|__|\\_________\\\\_________\\              \\|_______|\\|_______|    \\|__|
                                      \\|_________\\|_________|    
""" + Style.RESET_ALL)

# Добавление подписи с светло-зелёным цветом
print(Fore.LIGHTGREEN_EX + "                                                               by salukiDew\n" + Style.RESET_ALL)

# Вывод меню
print(Fore.LIGHTBLACK_EX + "  *Choose an option below*\n")
print(Fore.YELLOW + "  1. Accounts info")
print(Fore.YELLOW + "  2. Farm points")
print(Fore.YELLOW + "  3. Settings\n" + Style.RESET_ALL)

# Поле ввода с отображением стрелочки > в белом цвете
user_input = input(Fore.WHITE + "> " + Style.RESET_ALL)
